Here is the partitioned DOMXPathNodeList: 
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Juelz T.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          13 friends
                                        
                                        
                                          56 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Juelz T.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Juelz T.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/16/2016
                                  
                                  
                                    There is no worst way to start a weekend... It is Saturday morning and you drop your new phone and completely shatter your phone! :(
                                    When I first started to search for a repair provider, I came to discover that they were not available, have run out of the supplies, or simply don't respond.  On the contrary to that, Jacob with Mobile iPhone iPad screen repair was our light at the end of the tunnel. We need our phone repaired today, and he is able to accommodate and fit us in!
                                    Once we meet up, with Jacob, he's amazing! He is friendly, professional, and fast! He did an amazing job repairing our phone!!
                                    So if you find yourself in a pinch like us, Jacob is the guy to contact!!  Thank you, Jacob!! Hopefully I don't need my iPhone 7 or 7s repair in the future!  :)
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Dorian E.
                                        
                                        
                                          Framingham, MA
                                        
                                      
                                          37 friends
                                        
                                        
                                          11 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Dorian E.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Dorian E.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/2/2016
                                  
                                  
                                    it's a Saturday evening. I'm watching the sunset at Cardiff beach, when I have the bright idea to get a time lapse of said sunset on my iPhone 6 Plus. cool right? until you prop it up without any support, & get a text, vibrates, & falls, boom. cracked screen. this happened at 7:20pm. so what do I do? hop on Yelp to see who can fix my phone.
                                    everyone is either closing soon, or already closed. come across Jacob & his company, it says 24/7.  24/7 huh? so I call this guy, & ask him when can get get me in for this broke phone of mine. he says, 3pm tomorrow. I tell him, cmon bro, I can't be out here looking reckless. can you fit me in tonight?
                                    now I'm in del mar, & he says if you can meet me in santee at 8, I got you.
                                    ok. bet.
                                    head down to santee at this little Starbucks. side note. there was a guy in there on his laptop play WOW, & talking to his bros. thought that was funny. anyways, here's my man Jake sitting, looking like Morpheus from the matrix. lol. tools and parts, ready to go. this guy is a wizard. screws stick to the screw driver via magnets, & he's doing this screen replacement like a one man nascar pit crew. 730 screen is cracked. 830 phone looks like new. not to mention, he threw on a screen protector for free as well.
                                    oh, and my friend, her screen is cracked too, she opted not to get it fixed tonight. Jake really cares, & put on a screen protector on her phone as well, for free, to prevent further damage. now if that's not good service, idk what is.
                                    I don't plan on breaking my phone anytime soon, again, but I will deff be sending any one and everyone I know who needs repair, his way.
                                  
                                  
                                      
                                        
                                        
                                          
                                            after.
                                          
                                        after.
                                      
                                    
                                    
                                      
                                        
                                        
                                          
                                            before.
                                          
                                        before.
                                      
                                    
                                  
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Erik S.
                                        
                                        
                                          San Antonio, TX
                                        
                                      
                                          1 friend
                                        
                                        
                                          9 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Erik S.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Erik S.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     3/31/2016
                                  
                                  
                                    Jacob and Devin came to my place of work, which was really handy because of the long hours I usually have to work.  
                                    Within 20 minutes they had my iPhone up and running again, and their prices were no more than what a retail location would charge.  And I didn't even have to go anywhere or go back later to pick up.
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Cynthia B.
                                        
                                        
                                          Aptos, CA
                                        
                                      
                                          357 friends
                                        
                                        
                                          469 reviews
                                        
                                        
                                          Elite ’16
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Cynthia B.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Cynthia B.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     3/31/2016
                                  
                                  
                                    1 check-in
                                  
                                  
                                    After having a newborn and visiting family it's not as easy to run errands. And fixing my phone was the last thing on my list. But, after finding this service and receiving a quick reply from Jacob I decided to move this up my list.
                                    Pros:
                                    -cheaper than brick and mortar locations
                                    -easy to schedule
                                    -comes to you! (Came to us in Poway)
                                    -fixed in less than 10 minutes
                                    Cons: None!
                                    Highly recommend
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 1
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 1
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Rachel C.
                                        
                                        
                                          El Cajon, San Diego, CA
                                        
                                      
                                          0 friends
                                        
                                        
                                          3 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Rachel C.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Rachel C.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/10/2016  Updated review
                                  
                                  
                                    Jacob once again came to the rescue for my shattered screen. He was super flexible with scheduling, was able to come earlier than scheduled, and was very professional while working. I still love how he comes to you! No dealing with store hours, having to take off work, having my phone sent out. This is just a great service! I can't see using anyone else for my iDisasters! Thanks again, Jacob!
                                  
                                  
                                      
                                        
                                        
                                          
                                            Disaster!
                                          
                                        Disaster!
                                      
                                    
                                  
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 1
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                                
                                  
                                    
                                      
                                    12/4/2014 Previous review
                                  Absolutely stoked that I can completely shatter my phone and have it fixed all
                                  in the span of a… Absolutely stoked that I can completely shatter my phone and have it fixed all
                                  in the span of a couple of hours. And having him come to me wherever I was, that was absolutely stellar. You don't get that kind of service anymore, and I really appreciated it.  My screen is beautiful, the repair took minutes, and the cost was less than I expected. Thank you again for getting my girl all new looking again!! Read more
                                  
                                    
                                      
                                        Was this review …?
                                      
                                      
                                           Useful 
                                        
                                        
                                           Funny 
                                        
                                        
                                           Cool 
                                        
                                      
                                  
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Beth F.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          5 friends
                                        
                                        
                                          42 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Beth F.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Beth F.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/22/2016
                                  
                                  
                                    So glad that I found Jacob and Devin today on yelp with their Mobile iRepair of SD.  I was in the middle of preparing dinner at my home for a large party and dropped my iPhone 6 on the hard floor.  I was hesitate to have them come to my house but they were have wonderful customer service and very polite.  I found them on yelp and I am glad that I did.  Thank you very much for fixing my phone so fast and allowing me to have the time to go back and finish preparing for tonight's feast!
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          jay c.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          16 friends
                                        
                                        
                                          6 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow jay c.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following jay c.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/20/2016
                                  
                                  
                                    From the moment I called these guys were on it. I called them, they picked up on the first ring, set a time to come by, and even showed up early, but of course called ahead. Very reliable and great customer service. Wish i broke my phone more often, as these guys run a solid service, and would recommend them to anyone.
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          John H.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          113 friends
                                        
                                        
                                          35 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow John H.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following John H.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     3/14/2016
                                  
                                  
                                    This is how you build a business, folks. Be professional. Be on time. Be friendly. And be good at what you do.
                                    And these gents are doing it right. They responded to my quote request almost immediately. They arrived early to the appointment. They were friendly. And they were quick to repair the broken screen. And they offered extra phone protection with a glass screen cover.
                                    You may find a (slightly) cheaper repair. You may find someone available immediately. But you won't find this service and value elsewhere.
                                    And yes, I am typing this review on my cell phone. I can do that now that the gentlemen have repaired the cracked screen.
                                    John
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          William H.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          0 friends
                                        
                                        
                                          3 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow William H.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following William H.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/8/2016
                                  
                                  
                                    So the wife dropped the IPad Mini getting our son out of the car. As she is flying out tomorrow, we needed an immediate repair so our son can use on the plane. Jacob and Devin came to house and replaced the screen flawlessly. They called and said they would be early which was awesome. Great customer service!! Great price and they come to you for no additional charge. Highly recommended for your repairs.
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 1
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 1
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Susan C.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          37 friends
                                        
                                        
                                          52 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Susan C.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Susan C.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/11/2016
                                  
                                  
                                    This is the second time that I have used their service and could not be more pleased. Their prices are reasonable, they come to you and get the job done quickly. I highly recommend them for professional/friendly service and high quality repairs. They are the type of people that you do not mind having in your home. I would recommend them to anyone looking for a repair.
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Georgia M.
                                        
                                        
                                          Encinitas, CA
                                        
                                      
                                          30 friends
                                        
                                        
                                          5 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Georgia M.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Georgia M.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/6/2016  Updated review
                                  
                                  
                                    These guys are the best! Crazy reasonable pricing for repairs! Fast, reliable and honest. They are a pleasure to work with too! Give them a call...don't delay and get your screen fixed today!
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 1
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                                
                                  
                                    
                                      
                                    9/3/2014 Previous review
                                  Jesus does fabulous work and he comes to you. he is on time and very reliable! His follow up to take… Jesus does fabulous work and he comes to you. he is on time and very reliable! His follow up to take care of your needs is amazing. He fixed my ipad at my office and I was back up and running in minutes. I would highly recommend him to anyone in need of repair services. Read more
                                  
                                    
                                      
                                        Was this review …?
                                      
                                      
                                           Useful 
                                        
                                        
                                           Funny 
                                        
                                        
                                           Cool 1
                                        
                                      
                                  
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Lisa H.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          0 friends
                                        
                                        
                                          4 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Lisa H.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Lisa H.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     3/25/2016
                                  
                                  
                                    They did a great job, called them and had my phone fixed within the thirty minutes.
                                    Thanks
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Jessica P.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          139 friends
                                        
                                        
                                          2 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Jessica P.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Jessica P.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/18/2016
                                  
                                  
                                    Very fast service! They came to my work place and fixed my broken screen within an hour of calling them. Definitely worth it and cheapest price I found. Thanks guys!
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Jenn O.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          180 friends
                                        
                                        
                                          3 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Jenn O.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Jenn O.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/12/2016
                                  
                                  
                                    I love these guys!  I called...they came to my office...fixed my shattered screen...were very efficient and skilled and left within 20 minutes...easy peasy!  I would definitely recommend them to anyone who needs their screen repaired, especially if they want it done correctly!  Their mobile service is the best part, I didn't have to interrupt my busy schedule, they definitely saved the day!!
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          J C.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          0 friends
                                        
                                        
                                          8 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow J C.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following J C.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/24/2016
                                  
                                  
                                    Great customer service. They came out to fix my iPad 3 screen on time and efficiently. They even gave me some travel tips for an upcoming trip to DC.
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Erica R.
                                        
                                        
                                          Half Moon Bay, CA
                                        
                                      
                                          4 friends
                                        
                                        
                                          10 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Erica R.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Erica R.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/5/2016
                                  
                                  
                                    My iPhone 6plus screen shattered into pieces:( and Jacob came to my rescue.   He responded promptly to my messages and was at my house soon after.   I'm extremely attached to my phone so it was really important to get my phone fixed ASAP.   I got the lowest quote from Jocab and it was worth every penny.   Within 15min my phone looked like new!.
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Donna S.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          0 friends
                                        
                                        
                                          1 review
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Donna S.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Donna S.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/18/2016
                                  
                                  
                                    Mobile I repair of San Diego is awesome. If you break the glass on your iPhone and iPad which I did they come to your house and they fix it. They use all Apple equipment. But most of all these people are professional and fast!! I hope I don't have to call them one more time because I broke the glass again but if you have the problems that I had with both iPhone and iPad don't call anyone else but Mobile Irepair these are the guys to call.  thank you Jacob and Devin
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Chris S.
                                        
                                        
                                          Del Mar, CA
                                        
                                      
                                          0 friends
                                        
                                        
                                          17 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Chris S.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Chris S.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/3/2016
                                  
                                  
                                    Guys were great.  Did a phenomenal job.  iPhone repair came out perfect!  I would recommend them to anyone who needs an iPhone or iPad screen repair
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Kishore L.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          0 friends
                                        
                                        
                                          3 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Kishore L.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Kishore L.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     3/11/2016
                                  
                                  
                                    While I was looking for someone to fix the broken screen of my wife's iPhone 6plus, I came across numerous options on Yelp. Thanks to the "Request quote" feature , I was able to fan out a quote request to multiple vendors. The first response that I got , within a minute , was from Jacob. And none of the others were able to beat the price quoted by Jacob
                                    The fact that they offer a mobile repair service was an added bonus considering our unpredictable schedules.
                                    Set up an appointment for next day at my workplace. Jacob and Devin showed up a bit earlier in fact
                                    They were extremely professional , knowledgable ,got down to work without wasting a second. And replaced the broken screen in a jiffy.
                                    Also offered a tempered glass protector for a discount. The phone looked neat and new but I noticed some lines showing up when the screen was black. I just called them again to check if anything was wrong. They absolutely didn't mind coming back and checked once again. I really appreciate the honesty of these guys for I'm sure 9/10 times I would have gotten a response that it was an existing fault with the phone if I had gone else where to fix the screen. Jacob did admit it was a problem with the screen(albeit the first instance for a 6 plus screen )and instantly replaced with another one without any issues
                                    On the whole it was a smooth process and would definitely seek out these guys if anything untoward happens to our phones  in the future
                                  
                                  
                                      
                                        
                                        
                                          
                                            After
                                          
                                        After
                                      
                                    
                                    
                                      
                                        
                                        
                                          
                                            Before
                                          
                                        Before
                                      
                                    
                                  
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================
                              
                                
                                  
                                    
                                      
                                        
                                      
                                    
                                    
                                      
                                          Cassie C.
                                        
                                        
                                          San Diego, CA
                                        
                                      
                                          5 friends
                                        
                                        
                                          3 reviews
                                        
                                      
                                  
                                  
                                      
                                      
                                      
                                        Share review
                                      
                                    
                                    
                                      
                                      
                                      
                                        Compliment
                                      
                                    
                                    
                                      
                                      
                                      
                                        Send message
                                      
                                    
                                    
                                      
                                      
                                      
                                        Follow Cassie C.
                                      
                                    
                                    
                                      
                                      
                                      
                                        Stop following Cassie C.
                                      
                                    
                                  
                              
                              
                                
                                  
                                    
                                      
                                        
                                      
                                     4/1/2016
                                  
                                  
                                    Very nice people, Were not able to assist me with the fix, but they referred and helped me greatly.
                                  
                                
                                
                                  
                                    
                                      Was this review …?
                                    
                                    
                                         Useful 
                                      
                                      
                                         Funny 
                                      
                                      
                                         Cool 
                                      
                                    
                                
                              
                            
====================Attempting to partition the page.

Juelz T.Dorian E.Erik S.Cynthia B.Rachel C.Beth F.jay c.John H.William H.Susan C.Georgia M.Lisa H.Jessica P.Jenn O.J C.Erica R.Donna S.Chris S.Kishore L.Cassie C.